mslawicz/S32K396_IO_FR_test_M7_0_2/generate/include/Power_Ip_Cfg_Defines.h
#define McuConf_McuResetReasonConf_MCU_STCU_URF_RESET   ((uint8)2U)

#define McuConf_McuResetReasonConf_MCU_MC_RGM_FRE_RESET   ((uint8)3U)

#define McuConf_McuResetReasonConf_MCU_FXOSC_FAIL_RESET   ((uint8)4U)

#define McuConf_McuResetReasonConf_MCU_PLL_LOL_RESET   ((uint8)5U)

#define McuConf_McuResetReasonConf_MCU_CORE_CLK_FAIL_RESET   ((uint8)6U)

#define McuConf_McuResetReasonConf_MCU_AIPS_PLAT_CLK_FAIL_RESET   ((uint8)7U)

#define McuConf_McuResetReasonConf_MCU_HSE_CLK_FAIL_RESET   ((uint8)8U)

#define McuConf_McuResetReasonConf_MCU_SYS_DIV_FAIL_RESET   ((uint8)9U)

#define McuConf_McuResetReasonConf_MCU_CM7_CORE_CLK_FAIL_RESET   ((uint8)10U)

#define McuConf_McuResetReasonConf_MCU_HSE_TMPR_RST_RESET   ((uint8)11U)

#define McuConf_McuResetReasonConf_MCU_HSE_SNVS_RST_RESET   ((uint8)12U)

#define McuConf_McuResetReasonConf_MCU_SW_DEST_RESET   ((uint8)13U)

#define McuConf_McuResetReasonConf_MCU_DEBUG_DEST_RESET   ((uint8)14U)

#define McuConf_McuResetReasonConf_MCU_F_EXR_RESET   ((uint8)15U)

#define McuConf_McuResetReasonConf_MCU_FCCU_RST_RESET   ((uint8)16U)

#define McuConf_McuResetReasonConf_MCU_ST_DONE_RESET   ((uint8)17U)

#define McuConf_McuResetReasonConf_MCU_SWT0_RST_RESET   ((uint8)18U)

#define McuConf_McuResetReasonConf_MCU_SWT1_RST_RESET   ((uint8)19U)

#define McuConf_McuResetReasonConf_MCU_SWT2_RST_RESET   ((uint8)20U)

#define McuConf_McuResetReasonConf_MCU_JTAG_RST_RESET   ((uint8)21U)

#define McuConf_McuResetReasonConf_MCU_SWT3_RST_RESET   ((uint8)22U)

#define McuConf_McuResetReasonConf_MCU_PLL_AUX_RESET   ((uint8)23U)

#define McuConf_McuResetReasonConf_MCU_HSE_SWT_RST_RESET   ((uint8)24U)

#define McuConf_McuResetReasonConf_MCU_HSE_BOOT_RST_RESET   ((uint8)25U)

#define McuConf_McuResetReasonConf_MCU_SW_FUNC_RESET   ((uint8)26U)

#define McuConf_McuResetReasonConf_MCU_DEBUG_FUNC_RESET   ((uint8)27U)

#define McuConf_McuResetReasonConf_MCU_WAKEUP_REASON   ((uint8)28U)

#define McuConf_McuResetReasonConf_MCU_NO_RESET_REASON   ((uint8)29U)

#define McuConf_McuResetReasonConf_MCU_MULTIPLE_RESET_REASON   ((uint8)30U)

#define McuConf_McuResetReasonConf_MCU_RESET_UNDEFINED   ((uint8)31U)
/**
* @brief           This define controls the availability of function Mcu_SleepOnExit
*/
#define POWER_IP_SLEEPONEXIT_SUPPORT         (STD_ON)
/**
* @brief            Support Mc_Me COFB (COFB regiter present).
*/
#define POWER_IP_MC_ME_COFB_SUPPORT                 (STD_ON)
/***********************************************************/
/*                 MC_ME_PRTN0_COFB0_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN0_COFB0_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ3_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ4_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ5_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ6_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ7_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ8_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ9_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ10_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ11_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ12_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ13_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ14_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ15_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ16_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ17_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ18_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ19_MASK | \
                    MC_ME_PRTN0_COFB0_CLKEN_REQ20_MASK | \
                    0x00000000))
#define MC_ME_PRTN0_COFB0_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN0_COFB0_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN0_COFB1_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN0_COFB1_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ32_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ33_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ34_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ38_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ39_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ40_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ41_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ42_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ43_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ44_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ45_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ46_MASK | \
                    MC_ME_PRTN0_COFB1_CLKEN_REQ47_MASK | \
                    0x00000000))
#define MC_ME_PRTN0_COFB1_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN0_COFB1_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN1_COFB0_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN1_COFB0_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ3_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ4_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ5_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ6_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ7_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ8_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ9_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ10_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ11_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ12_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ13_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ14_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ15_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ21_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ23_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ24_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ28_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ29_MASK | \
                    MC_ME_PRTN1_COFB0_CLKEN_REQ31_MASK | \
                    0x00000000))
#define MC_ME_PRTN1_COFB0_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN1_COFB0_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN1_COFB1_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN1_COFB1_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ32_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ33_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ34_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ42_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ45_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ47_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ56_MASK | \
                    MC_ME_PRTN1_COFB1_CLKEN_REQ63_MASK | \
                    0x00000000))
#define MC_ME_PRTN1_COFB1_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN1_COFB1_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN1_COFB2_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN1_COFB2_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ65_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ66_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ67_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ68_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ69_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ70_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ73_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ74_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ75_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ76_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ77_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ84_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ85_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ86_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ87_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ88_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ89_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ92_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ93_MASK | \
                    MC_ME_PRTN1_COFB2_CLKEN_REQ95_MASK | \
                    0x00000000))
#define MC_ME_PRTN1_COFB2_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN1_COFB2_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN1_COFB3_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN1_COFB3_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN1_COFB3_CLKEN_REQ96_MASK | \
                    MC_ME_PRTN1_COFB3_CLKEN_REQ104_MASK | \
                    0x00000000))
#define MC_ME_PRTN1_COFB3_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN1_COFB3_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN2_COFB0_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN2_COFB0_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ4_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ5_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ6_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ7_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ8_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ9_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ10_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ11_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ12_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ13_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ14_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ15_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ16_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ17_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ18_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ19_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ20_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ21_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ22_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ23_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ24_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ27_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ28_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ29_MASK | \
                    MC_ME_PRTN2_COFB0_CLKEN_REQ30_MASK | \
                    0x00000000))
#define MC_ME_PRTN2_COFB0_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN2_COFB0_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN2_COFB1_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN2_COFB1_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN2_COFB1_CLKEN_REQ32_MASK | \
                    MC_ME_PRTN2_COFB1_CLKEN_REQ47_MASK | \
                    MC_ME_PRTN2_COFB1_CLKEN_REQ48_MASK | \
                    MC_ME_PRTN2_COFB1_CLKEN_REQ51_MASK | \
                    MC_ME_PRTN2_COFB1_CLKEN_REQ60_MASK | \
                    MC_ME_PRTN2_COFB1_CLKEN_REQ61_MASK | \
                    0x00000000))
#define MC_ME_PRTN2_COFB1_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN2_COFB1_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN2_COFB2_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN2_COFB2_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN2_COFB2_CLKEN_REQ65_MASK | \
                    MC_ME_PRTN2_COFB2_CLKEN_REQ66_MASK | \
                    MC_ME_PRTN2_COFB2_CLKEN_REQ67_MASK | \
                    MC_ME_PRTN2_COFB2_CLKEN_REQ68_MASK | \
                    MC_ME_PRTN2_COFB2_CLKEN_REQ69_MASK | \
                    0x00000000))
#define MC_ME_PRTN2_COFB2_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN2_COFB2_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN3_COFB0_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN3_COFB0_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ0_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ1_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ2_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ3_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ4_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ5_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ6_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ7_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ8_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ9_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ10_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ11_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ12_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ13_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ14_MASK | \
                    MC_ME_PRTN3_COFB0_CLKEN_REQ15_MASK | \
                    0x00000000))
#define MC_ME_PRTN3_COFB0_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN3_COFB0_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN3_COFB1_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN3_COFB1_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ32_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ34_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ35_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ36_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ37_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ40_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ41_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ44_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ46_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ47_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ48_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ49_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ50_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ51_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ52_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ53_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ54_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ55_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ56_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ57_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ58_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ59_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ61_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ62_MASK | \
                    MC_ME_PRTN3_COFB1_CLKEN_REQ63_MASK | \
                    0x00000000))
#define MC_ME_PRTN3_COFB1_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN3_COFB1_CLKEN_RWBITS_MASK))
/***********************************************************/
/*                 MC_ME_PRTN3_COFB2_CLKEN                 */
/***********************************************************/
#define MC_ME_PRTN3_COFB2_CLKEN_RWBITS_MASK  ((uint32)( \
                    MC_ME_PRTN3_COFB2_CLKEN_REQ64_MASK | \
                    MC_ME_PRTN3_COFB2_CLKEN_REQ65_MASK | \
                    0x00000000))
#define MC_ME_PRTN3_COFB2_CLKEN(value)       ((uint32)(((uint32)(value)) & MC_ME_PRTN3_COFB2_CLKEN_RWBITS_MASK))

/*==================================================================================================
                                             ENUMS
==================================================================================================*/


/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/



#ifdef __cplusplus
}
#endif

/** @} */
#endif /* #ifndef POWER_IP_CFG_DEFINES_H */


